class Solution:
    def isSubsequence(self, s: str, t: str) -> bool:
        n, m = len(s), len(t)
        
        # Tạo bảng DP (n+1) x (m+1) khởi tạo bằng 0
        dp = [[0] * (m + 1) for _ in range(n + 1)]

        for i in range(1, n + 1):
            for j in range(1, m + 1):
                if s[i - 1] == t[j - 1]:
                    dp[i][j] = dp[i - 1][j - 1] + 1 
                else:
                    dp[i][j] = max(dp[i - 1][j], dp[i][j - 1])
        
        return dp[n][m] == n
            


#       ""   a   b   c   d   e  (Chuỗi t)
#       +---+---+---+---+---+---+
# ""    | 0 | 0 | 0 | 0 | 0 | 0 |
#       +---+---+---+---+---+---+
# a     | 0 | 0 | 0 | 0 | 0 | 0 |
#       +---+---+---+---+---+---+
# c     | 0 | 0 | 0 | 0 | 0 | 0 |
#       +---+---+---+---+---+---+
# e     | 0 | 0 | 0 | 0 | 0 | 0 |
#       +---+---+---+---+---+---+
# (Chuỗi s)

# sau khi điền
#       ""   a   b   c   d   e
#       +---+---+---+---+---+---+
# ""    | 0 | 0 | 0 | 0 | 0 | 0 |
#       +---+---+---+---+---+---+
# a     | 0 | 1 | 1 | 1 | 1 | 1 |
#       +---+---+---+---+---+---+
# c     | 0 | 1 | 1 | 2 | 2 | 2 |
#       +---+---+---+---+---+---+
# e     | 0 | 1 | 1 | 2 | 2 | 3 |  <- KẾT QUẢ: Góc dưới cùng bên phải
#       +---+---+---+---+---+---+